# import

In [2]:
import numpy as np
import pandas as pd

# 对象创建

## Serires对象(只有一列, 一个feature)

series 是带标签的一维数组

`pandas.Series(data=None, index=None, dtype=None)`

### 用列表创建(没有label)

In [3]:
# index(标签)缺省, 默认为整数序列

data = pd.Series([1.5, 3, 4.5, 6])
data

0    1.5
1    3.0
2    4.5
3    6.0
dtype: float64

In [4]:
# 指定index(标签)
data = pd.Series(data=[1.5, 3, 4.5, 6], index=["a", "b", "c", "d"])
data

a    1.5
b    3.0
c    4.5
d    6.0
dtype: float64

In [5]:
# 指定数据类型, 默认根据类型自己判断
data = pd.Series(data=[1, 3, 4, 6], index=["a", "b", "c", "d"], dtype=int)
data

a    1
b    3
c    4
d    6
dtype: int64

#### 数据支持多种类型

此时, dtype会向更高层级的类型跃迁 ==> object

In [6]:
data = pd.Series(data=[1, "hello world", 4, 6], index=["a", "b", "c", "d"])
data

a              1
b    hello world
c              4
d              6
dtype: object

#### 数据类型可被强制的改变

In [7]:
data = pd.Series(data=[1, "2", 4, 6], index=["a", "b", "c", "d"], dtype=int)
data

/opt/anaconda3/lib/python3.8/site-packages/numpy/core/numeric.py:2378: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  return bool(asarray(a1 == a2).all())

a    1
b    2
c    4
d    6
dtype: int64

### 用numpy数组创建(没有label)

In [8]:
x = np.arange(10, 20)
x

pd.Series(x)

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int64

### 用字典dict创建(指定了label)

In [9]:
dict = {"beijing": "1234", "nanjing": "5678"}

data = pd.Series(dict)
data

beijing    1234
nanjing    5678
dtype: object

In [10]:
# 用字典创建, 如果指定了index, 只会显示指定的index, 如果index找不到, 对应value就会设置为NaN

data = pd.Series(data=dict, index=["beijing", "shagnhai"])
data

beijing     1234
shagnhai     NaN
dtype: object

### data为标量(自动补齐)

In [11]:
# value会自动复制
data = pd.Series(5, index=["a", "b", "c"])
data

a    5
b    5
c    5
dtype: int64

## DataFrame对象(多列,多维feature)

DataFrame对象是带标签的多维数组(**除了行标签, 还多了一个列标签**)

### 通过Series(本身含有label)创建对象

In [12]:
dict = {"beijing": "1234", "nanjing": "5678"}

data = pd.Series(dict)
pd.DataFrame(data)

            0
beijing  1234
nanjing  5678

In [13]:
# 指定columns(feature)
dict = {"beijing": "1234", "nanjing": "5678"}

data = pd.Series(dict)
pd.DataFrame(data, columns=["population"])

        population
beijing       1234
nanjing       5678

### 通过Series(本身含有label) 字典(指定了columns), 创建DataFrame对象

In [14]:
population_dict = {"beijing": 1234, "shanghai": 5678}

gdp_dict = {"beijing": 1, "shanghai": 2}

population = pd.Series(population_dict)
gdp = pd.Series(gdp_dict)

# "pupulatin"/"gdp"为column名字
pd.DataFrame({"population": population, "gdp": gdp})

          population  gdp
beijing         1234    1
shanghai        5678    2

In [15]:
# 如果某列的数量不够, 会自动补齐 ("China")
pd.DataFrame({"population": population, "gdp": gdp, "country": "China"})

          population  gdp country
beijing         1234    1   China
shanghai        5678    2   China

### 通过字典列表创建(不带label, 指定了columns)

In [16]:
# "a"/"b"为column
data = [{"a": i, "b": 2 * i} for i in range(3)]
# [{'a': 0, 'b': 0}, {'a': 1, 'b': 2}, {'a': 2, 'b': 4}]

pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

In [17]:
# column缺失的情况, 缺失的column, 值为NaN
data = [{"a": 0, "b": 0}, {"b": 1, "c": 2}, {"a": 2, "b": 4}]

pd.DataFrame(data)

     a  b    c
0  0.0  0  NaN
1  NaN  1  2.0
2  2.0  4  NaN

### 通过numpy的二维数组创建(不带label和columns)

In [18]:
data = np.random.randint(1, 10, size=(2, 3))

pd.DataFrame(
    data, index=["lable_1", "label_2"], columns=["feature_1", "feature_2", "feature_3"]
)

         feature_1  feature_2  feature_3
lable_1          4          8          9
label_2          2          4          3

# DataFrame的性质

## 属性

In [19]:
population_dict = {"beijing": 1234, "shanghai": 5678}

gdp_dict = {"beijing": 1, "shanghai": 2}

population = pd.Series(population_dict)
gdp = pd.Series(gdp_dict)

# "pupulatin"/"gdp"为column名字
data = pd.DataFrame({"population": population, "gdp": gdp})
data

          population  gdp
beijing         1234    1
shanghai        5678    2

### df.values 返回numpy数组表示的value

In [20]:
## df.values 返回numpy数组表示的value
data.values  # 去除label和columns

array([[1234,    1],
       [5678,    2]])

### df.index 获取label

In [21]:
data.index

Index(['beijing', 'shanghai'], dtype='object')

### df.columns 获取columns

In [22]:
data.columns

Index(['population', 'gdp'], dtype='object')

### df.shape 形状

In [23]:
data.shape

(2, 2)

### df.size 数据个数

In [24]:
data.size

4

### df.dyptes 每列的数据类型

In [25]:
data.dtypes

population    int64
gdp           int64
dtype: object

## 索引

In [26]:
population_dict = {"beijing": 1234, "shanghai": 5678}

gdp_dict = {"beijing": 1, "shanghai": 2}

population = pd.Series(population_dict)
gdp = pd.Series(gdp_dict)

# "pupulatin"/"gdp"为column名字
data = pd.DataFrame({"population": population, "gdp": gdp})
data

          population  gdp
beijing         1234    1
shanghai        5678    2

### 获取列

DataFrame的一列是一个Series

#### 字典式(带有标签)

In [27]:
data["population"]

beijing     1234
shanghai    5678
Name: population, dtype: int64

In [28]:
# 同时获取多个列
data[["population", "gdp"]]

          population  gdp
beijing         1234    1
shanghai        5678    2

#### 对象属性 "." 方式

In [29]:
data.gdp

beijing     1
shanghai    2
Name: gdp, dtype: int64

### 获取行

#### 绝对索引 df.loc

In [30]:
data.loc["beijing"]

population    1234
gdp              1
Name: beijing, dtype: int64

In [31]:
# 获取多行的数据
data.loc[["beijing", "shanghai"]]

          population  gdp
beijing         1234    1
shanghai        5678    2

#### 相对索引 df.iloc

In [32]:
data.iloc[0]

population    1234
gdp              1
Name: beijing, dtype: int64

In [33]:
data.iloc[[0, 1]]

          population  gdp
beijing         1234    1
shanghai        5678    2

### 获取标量

In [34]:
data.loc["beijing", "population"]

1234

In [35]:
data.iloc[0, 0]

1234

In [36]:
data.values[0][0]

1234

### Series对象的索引

In [37]:
gdp = data.gdp  # DataFrame的一列, 是Series对象
type(gdp)

pandas.core.series.Series

In [38]:
gdp

beijing     1
shanghai    2
Name: gdp, dtype: int64

In [39]:
# 指定label
gdp["beijing"]

1

## 切片

In [40]:
dates = pd.date_range(start="2021-01-01", periods=6)
dates

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06'],
              dtype='datetime64[ns]', freq='D')

In [41]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=["a", "b", "c", "d"])
df

                   a         b         c         d
2021-01-01 -0.571404 -0.322289 -2.338827  0.367850
2021-01-02 -1.963897 -0.719725  0.621990  1.580158
2021-01-03  0.619116  0.903904  2.233307 -0.116280
2021-01-04 -0.452096 -2.281780 -0.337880 -1.173924
2021-01-05  0.538145 -0.403059  0.674491  0.211629
2021-01-06  1.164064  1.018252 -0.202403  2.741286

### 行切片

In [42]:
df["2021-01-01":"2021-01-03"]

                   a         b         c         d
2021-01-01 -0.571404 -0.322289 -2.338827  0.367850
2021-01-02 -1.963897 -0.719725  0.621990  1.580158
2021-01-03  0.619116  0.903904  2.233307 -0.116280

In [43]:
df.loc["2021-01-01":"2021-01-03"]

                   a         b         c         d
2021-01-01 -0.571404 -0.322289 -2.338827  0.367850
2021-01-02 -1.963897 -0.719725  0.621990  1.580158
2021-01-03  0.619116  0.903904  2.233307 -0.116280

In [44]:
df.iloc[0:3]

                   a         b         c         d
2021-01-01 -0.571404 -0.322289 -2.338827  0.367850
2021-01-02 -1.963897 -0.719725  0.621990  1.580158
2021-01-03  0.619116  0.903904  2.233307 -0.116280

### 列切片

In [45]:
df.loc[:, "a":"b"]

                   a         b
2021-01-01 -0.571404 -0.322289
2021-01-02 -1.963897 -0.719725
2021-01-03  0.619116  0.903904
2021-01-04 -0.452096 -2.281780
2021-01-05  0.538145 -0.403059
2021-01-06  1.164064  1.018252

In [46]:
df.iloc[:, 0:2]

                   a         b
2021-01-01 -0.571404 -0.322289
2021-01-02 -1.963897 -0.719725
2021-01-03  0.619116  0.903904
2021-01-04 -0.452096 -2.281780
2021-01-05  0.538145 -0.403059
2021-01-06  1.164064  1.018252

### 多样切片

#### 行，列同时切片

In [47]:
df.loc["2021-01-01":"2021-01-03", "a":"c"]

                   a         b         c
2021-01-01 -0.571404 -0.322289 -2.338827
2021-01-02 -1.963897 -0.719725  0.621990
2021-01-03  0.619116  0.903904  2.233307

In [48]:
df.iloc[0:3, 0:3]

                   a         b         c
2021-01-01 -0.571404 -0.322289 -2.338827
2021-01-02 -1.963897 -0.719725  0.621990
2021-01-03  0.619116  0.903904  2.233307

#### 行切片, 列离散取值

In [49]:
df.loc["2021-01-01":"2021-01-03", ["a", "c"]]

                   a         c
2021-01-01 -0.571404 -2.338827
2021-01-02 -1.963897  0.621990
2021-01-03  0.619116  2.233307

In [50]:
df.iloc[0:3, [0, 2]]

                   a         c
2021-01-01 -0.571404 -2.338827
2021-01-02 -1.963897  0.621990
2021-01-03  0.619116  2.233307

#### 列切片, 行离散取值

In [51]:
df.loc[["2021-01-01", "2021-01-03"], "a":"c"]

                   a         b         c
2021-01-01 -0.571404 -0.322289 -2.338827
2021-01-03  0.619116  0.903904  2.233307

In [52]:
df.iloc[[0, 2], 0:3]

                   a         b         c
2021-01-01 -0.571404 -0.322289 -2.338827
2021-01-03  0.619116  0.903904  2.233307

#### 行、列都分散取值

In [53]:
df.loc[["2021-01-01", "2021-01-03"], ["a", "c"]]

                   a         c
2021-01-01 -0.571404 -2.338827
2021-01-03  0.619116  2.233307

In [54]:
df.iloc[[0, 2], [0, 2]]

                   a         c
2021-01-01 -0.571404 -2.338827
2021-01-03  0.619116  2.233307

## 布尔索引

In [55]:
df

                   a         b         c         d
2021-01-01 -0.571404 -0.322289 -2.338827  0.367850
2021-01-02 -1.963897 -0.719725  0.621990  1.580158
2021-01-03  0.619116  0.903904  2.233307 -0.116280
2021-01-04 -0.452096 -2.281780 -0.337880 -1.173924
2021-01-05  0.538145 -0.403059  0.674491  0.211629
2021-01-06  1.164064  1.018252 -0.202403  2.741286

### 全局过滤数据

In [56]:
df > 0

                a      b      c      d
2021-01-01  False  False  False   True
2021-01-02  False  False   True   True
2021-01-03   True   True   True  False
2021-01-04  False  False  False  False
2021-01-05   True  False   True   True
2021-01-06   True   True  False   True

In [57]:
# 为False的都是NaN
df[df > 0]

                   a         b         c         d
2021-01-01       NaN       NaN       NaN  0.367850
2021-01-02       NaN       NaN  0.621990  1.580158
2021-01-03  0.619116  0.903904  2.233307       NaN
2021-01-04       NaN       NaN       NaN       NaN
2021-01-05  0.538145       NaN  0.674491  0.211629
2021-01-06  1.164064  1.018252       NaN  2.741286

### 根据列过滤数据

In [58]:
df.a > 0

2021-01-01    False
2021-01-02    False
2021-01-03     True
2021-01-04    False
2021-01-05     True
2021-01-06     True
Freq: D, Name: a, dtype: bool

In [59]:
# 只显示"a"列 > 0的数据
# 对列设置条件, 然后取出所有所有相应的行.
df[df.a > 0]

                   a         b         c         d
2021-01-03  0.619116  0.903904  2.233307 -0.116280
2021-01-05  0.538145 -0.403059  0.674491  0.211629
2021-01-06  1.164064  1.018252 -0.202403  2.741286

### isin 过滤方法

In [60]:
df2 = df.copy()
# 添加一列
df2["new_col"] = [1, 2, 3, 4, 5, 6]
df2

                   a         b         c         d  new_col
2021-01-01 -0.571404 -0.322289 -2.338827  0.367850        1
2021-01-02 -1.963897 -0.719725  0.621990  1.580158        2
2021-01-03  0.619116  0.903904  2.233307 -0.116280        3
2021-01-04 -0.452096 -2.281780 -0.337880 -1.173924        4
2021-01-05  0.538145 -0.403059  0.674491  0.211629        5
2021-01-06  1.164064  1.018252 -0.202403  2.741286        6

In [61]:
idx = df2.new_col.isin([3, 4])
idx

2021-01-01    False
2021-01-02    False
2021-01-03     True
2021-01-04     True
2021-01-05    False
2021-01-06    False
Freq: D, Name: new_col, dtype: bool

In [62]:
df2[idx]

                   a         b         c         d  new_col
2021-01-03  0.619116  0.903904  2.233307 -0.116280        3
2021-01-04 -0.452096 -2.281780 -0.337880 -1.173924        4

## 修改赋值

### DataFrame新增列

In [63]:
# 添加一列series
new_series = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("2021-01-01", periods=6))
new_series

2021-01-01    1
2021-01-02    2
2021-01-03    3
2021-01-04    4
2021-01-05    5
2021-01-06    6
Freq: D, dtype: int64

In [64]:
df["added_col"] = new_series
df

                   a         b         c         d  added_col
2021-01-01 -0.571404 -0.322289 -2.338827  0.367850          1
2021-01-02 -1.963897 -0.719725  0.621990  1.580158          2
2021-01-03  0.619116  0.903904  2.233307 -0.116280          3
2021-01-04 -0.452096 -2.281780 -0.337880 -1.173924          4
2021-01-05  0.538145 -0.403059  0.674491  0.211629          5
2021-01-06  1.164064  1.018252 -0.202403  2.741286          6

In [65]:
# 行数(样本数)
len(df)

# 添加一列array
df["add_col_2"] = np.array([5] * len(df))  # 可简化为 df["add_col_2"] = 5 (自动扩展)
df

                   a         b         c         d  added_col  add_col_2
2021-01-01 -0.571404 -0.322289 -2.338827  0.367850          1          5
2021-01-02 -1.963897 -0.719725  0.621990  1.580158          2          5
2021-01-03  0.619116  0.903904  2.233307 -0.116280          3          5
2021-01-04 -0.452096 -2.281780 -0.337880 -1.173924          4          5
2021-01-05  0.538145 -0.403059  0.674491  0.211629          5          5
2021-01-06  1.164064  1.018252 -0.202403  2.741286          6          5

### 修改元素

In [66]:
df.loc[
    "2021-01-01", "a"
] = 0  # do not use chained index "df.loc['2021-01-01']['a']", return a copy
df

                   a         b         c         d  added_col  add_col_2
2021-01-01  0.000000 -0.322289 -2.338827  0.367850          1          5
2021-01-02 -1.963897 -0.719725  0.621990  1.580158          2          5
2021-01-03  0.619116  0.903904  2.233307 -0.116280          3          5
2021-01-04 -0.452096 -2.281780 -0.337880 -1.173924          4          5
2021-01-05  0.538145 -0.403059  0.674491  0.211629          5          5
2021-01-06  1.164064  1.018252 -0.202403  2.741286          6          5

In [67]:
df.iloc[0, 1] = 1
df

                   a         b         c         d  added_col  add_col_2
2021-01-01  0.000000  1.000000 -2.338827  0.367850          1          5
2021-01-02 -1.963897 -0.719725  0.621990  1.580158          2          5
2021-01-03  0.619116  0.903904  2.233307 -0.116280          3          5
2021-01-04 -0.452096 -2.281780 -0.337880 -1.173924          4          5
2021-01-05  0.538145 -0.403059  0.674491  0.211629          5          5
2021-01-06  1.164064  1.018252 -0.202403  2.741286          6          5

### 修改index, columns

In [68]:
df.index = [i for i in range(df.shape[0])]
df

          a         b         c         d  added_col  add_col_2
0  0.000000  1.000000 -2.338827  0.367850          1          5
1 -1.963897 -0.719725  0.621990  1.580158          2          5
2  0.619116  0.903904  2.233307 -0.116280          3          5
3 -0.452096 -2.281780 -0.337880 -1.173924          4          5
4  0.538145 -0.403059  0.674491  0.211629          5          5
5  1.164064  1.018252 -0.202403  2.741286          6          5

In [69]:
df.columns = [i for i in range(df.shape[1])]
df

          0         1         2         3  4  5
0  0.000000  1.000000 -2.338827  0.367850  1  5
1 -1.963897 -0.719725  0.621990  1.580158  2  5
2  0.619116  0.903904  2.233307 -0.116280  3  5
3 -0.452096 -2.281780 -0.337880 -1.173924  4  5
4  0.538145 -0.403059  0.674491  0.211629  5  5
5  1.164064  1.018252 -0.202403  2.741286  6  5

# 数值运算 及 统计分析方法

## 数据的查看

In [70]:
df = pd.DataFrame(
    np.random.randn(6, 4),
    index=pd.date_range("2021-01-01", periods=6),
    columns=["a", " b", "c", "d"],
)
df

                   a         b         c         d
2021-01-01 -1.379534 -0.832866 -0.619483  0.747022
2021-01-02 -0.979025 -0.654753 -0.192361  1.043990
2021-01-03  0.314761  0.967870  0.146106  1.869937
2021-01-04 -0.669772 -0.421384 -0.141128 -1.061804
2021-01-05  0.672824 -0.308108  1.275238  0.400180
2021-01-06 -1.527496 -0.330921 -0.132932 -0.251193

### 查看前几行

In [71]:
df.head()

                   a         b         c         d
2021-01-01 -1.379534 -0.832866 -0.619483  0.747022
2021-01-02 -0.979025 -0.654753 -0.192361  1.043990
2021-01-03  0.314761  0.967870  0.146106  1.869937
2021-01-04 -0.669772 -0.421384 -0.141128 -1.061804
2021-01-05  0.672824 -0.308108  1.275238  0.400180

In [72]:
df.head(2)

                   a         b         c         d
2021-01-01 -1.379534 -0.832866 -0.619483  0.747022
2021-01-02 -0.979025 -0.654753 -0.192361  1.043990

### 查看后几行

In [73]:
df.tail()

                   a         b         c         d
2021-01-02 -0.979025 -0.654753 -0.192361  1.043990
2021-01-03  0.314761  0.967870  0.146106  1.869937
2021-01-04 -0.669772 -0.421384 -0.141128 -1.061804
2021-01-05  0.672824 -0.308108  1.275238  0.400180
2021-01-06 -1.527496 -0.330921 -0.132932 -0.251193

In [74]:
df.tail(2)

                   a         b         c         d
2021-01-05  0.672824 -0.308108  1.275238  0.400180
2021-01-06 -1.527496 -0.330921 -0.132932 -0.251193

### 查看整体信息

In [75]:
# index, columns, 每个column有几个非空数据
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2021-01-01 to 2021-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       6 non-null      float64
 1    b      6 non-null      float64
 2   c       6 non-null      float64
 3   d       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

## 计算

### numpy的计算, pandas都适用

#### 向量化计算

In [76]:
x = pd.DataFrame(np.arange(4).reshape(1, 4))
x

   0  1  2  3
0  0  1  2  3

In [77]:
x + 5

   0  1  2  3
0  5  6  7  8

In [78]:
np.exp(x)

     0         1         2          3
0  1.0  2.718282  7.389056  20.085537

In [79]:
y = pd.DataFrame(np.arange(4, 8).reshape(1, 4))
y

   0  1  2  3
0  4  5  6  7

In [80]:
x + y

   0  1  2   3
0  4  6  8  10

#### 矩阵运算

In [81]:
np.random.seed(42)
x = pd.DataFrame(np.random.randint(10, size=(30, 30)))
x

,0,1,2,3,4,5,6,7,8,9,...,20,21,22,23,24,25,26,27,28,29
0,6,3,7,4,6,9,2,6,7,4,...,4,0,9,5,8,0,9,2,6,3
1,8,2,4,2,6,4,8,6,1,3,...,2,0,3,1,7,3,1,5,5,9
2,3,5,1,9,1,9,3,7,6,8,...,6,8,7,0,7,7,2,0,7,2
3,2,0,4,9,6,9,8,6,8,7,...,0,2,4,2,0,4,9,6,6,8
4,9,9,2,6,0,3,3,4,6,6,...,9,6,8,6,0,0,8,8,3,8
5,2,6,5,7,8,4,0,2,9,7,...,2,0,4,0,7,0,0,1,1,5
6,6,4,0,0,2,1,4,9,5,6,...,5,0,8,5,2,3,3,2,9,2
7,2,3,6,3,8,0,7,6,1,7,...,3,0,1,0,4,4,6,8,8,2
8,2,2,3,7,5,7,0,7,3,0,...,1,1,5,2,8,3,0,3,0,4
9,3,7,7,6,2,0,0,2,5,6,...,4,2,3,2,0,0,4,5,2,8
10,4,7,0,4,2,0,3,4,6,0,...,5,6,1,9,1,9,0,7,0,8
11,5,6,9,6,9,2,1,8,7,9,...,6,5,2,8,9,5,9,9,5,0
12,3,9,5,5,4,0,7,4,4,6,...,0,7,2,9,6,9,4,9,4,6
13,8,4,0,9,9,0,1,5,8,7,...,5,8,4,0,3,4,9,9,4,6
14,3,0,4,6,9,9,5,4,3,1,...,6,1,0,3,7,1,2,0,0,2
15,4,2,0,0,7,9,1,2,1,2,...,6,3,9,4,1,7,3,8,4,8
16,3,9,4,8,7,2,0,2,3,1,...,8,0,0,3,8,5,2,0,3,8
17,2,8,6,3,2,9,4,4,2,8,...,6,9,4,2,6,1,8,9,9,0
18,5,6,7,9,8,1,9,1,4,4,...,3,5,2,5,6,9,9,2,6,2
19,1,9,3,7,8,6,0,2,8,0,...,4,3,2,2,3,8,1,8,0,0
20,4,5,5,2,6,8,9,7,5,7,...,3,5,0,8,0,4,3,2,5,1
21,2,4,8,1,9,7,1,4,6,7,...,0,1,8,2,0,4,6,5,0,4
22,4,5,2,4,6,4,4,4,9,9,...,1,7,6,9,9,1,5,5,2,1
23,0,5,4,8,0,6,4,4,1,2,...,8,5,0,7,6,9,2,0,4,3
24,9,7,0,9,0,3,7,4,1,5,...,3,7,8,2,2,1,9,2,2,4
25,4,1,9,5,4,5,0,4,8,9,...,9,3,0,7,0,2,3,7,5,9
26,6,7,1,9,7,2,6,2,6,1,...,0,6,5,9,8,0,3,8,3,9
27,2,8,1,3,5,1,7,7,0,2,...,8,0,4,5,4,5,5,6,3,7
28,6,8,6,2,2,7,4,3,7,5,...,1,7,9,2,4,5,9,5,3,2
29,3,0,3,0,0,9,5,4,3,2,...,1,3,0,4,8,0,8,7,5,6

In [82]:
# 转置
x.T

,0,1,2,3,4,5,6,7,8,9,...,20,21,22,23,24,25,26,27,28,29
0,6,8,3,2,9,2,6,2,2,3,...,4,2,4,0,9,4,6,2,6,3
1,3,2,5,0,9,6,4,3,2,7,...,5,4,5,5,7,1,7,8,8,0
2,7,4,1,4,2,5,0,6,3,7,...,5,8,2,4,0,9,1,1,6,3
3,4,2,9,9,6,7,0,3,7,6,...,2,1,4,8,9,5,9,3,2,0
4,6,6,1,6,0,8,2,8,5,2,...,6,9,6,0,0,4,7,5,2,0
5,9,4,9,9,3,4,1,0,7,0,...,8,7,4,6,3,5,2,1,7,9
6,2,8,3,8,3,0,4,7,0,0,...,9,1,4,4,7,0,6,7,4,5
7,6,6,7,6,4,2,9,6,7,2,...,7,4,4,4,4,4,2,7,3,4
8,7,1,6,8,6,9,5,1,3,5,...,5,6,9,1,1,8,6,0,7,3
9,4,3,8,7,6,7,6,7,0,6,...,7,7,9,2,5,9,1,2,5,2
10,3,8,7,1,3,5,3,0,7,5,...,4,0,2,6,4,1,9,9,1,0
11,7,1,4,0,6,7,6,8,3,5,...,7,5,0,5,1,0,5,8,3,5
12,7,9,1,6,2,8,7,8,5,5,...,9,0,4,1,2,9,2,4,3,1
13,2,8,4,6,5,3,0,1,7,2,...,3,1,8,5,8,8,2,5,5,7
14,5,9,7,7,1,0,5,6,3,5,...,9,0,0,1,6,9,8,3,5,9
15,4,4,9,4,9,0,7,9,2,7,...,7,4,2,1,6,8,6,9,0,4
16,1,1,8,2,8,9,4,2,8,1,...,9,9,3,1,5,8,4,1,7,6
17,7,3,8,7,4,3,3,6,2,4,...,1,8,0,2,7,5,9,7,5,9
18,5,6,0,5,5,6,1,9,8,0,...,4,5,0,1,3,7,6,5,2,1
19,1,7,8,2,3,1,5,8,1,0,...,8,0,7,3,7,0,8,4,8,7
20,4,2,6,0,9,2,5,3,1,4,...,3,0,1,8,3,9,0,8,1,1
21,0,0,8,2,6,0,0,0,1,2,...,5,1,7,5,7,3,6,0,7,3
22,9,3,7,4,8,4,8,1,5,3,...,0,8,6,0,8,0,5,4,9,0
23,5,1,0,2,6,0,5,0,2,2,...,8,2,9,7,2,7,9,5,2,4
24,8,7,7,0,0,7,2,4,8,0,...,0,0,9,6,2,0,8,4,4,8
25,0,3,7,4,0,0,3,4,3,0,...,4,4,1,9,1,2,0,5,5,0
26,9,1,2,9,8,0,3,6,0,4,...,3,6,5,2,9,3,3,5,9,8
27,2,5,0,6,8,1,2,8,3,5,...,2,5,5,0,2,7,8,6,5,7
28,6,5,7,6,3,1,9,8,0,2,...,5,0,2,4,2,5,3,3,3,5
29,3,9,2,8,8,5,2,2,4,8,...,1,4,1,3,4,9,9,7,2,6

In [83]:
# 矩阵乘法
np.random.seed(1)
y = pd.DataFrame(np.random.randint(10, size=(30, 30)))

np.dot(x, y)

array([[616, 560, 723, 739, 612, 457, 681, 799, 575, 590, 627, 585, 492,
        721, 524, 647, 555, 561, 662, 668, 523, 739, 613, 580, 668, 602,
        733, 585, 657, 700],
       [520, 438, 691, 600, 612, 455, 666, 764, 707, 592, 547, 572, 446,
        649, 488, 687, 475, 558, 655, 670, 555, 681, 503, 679, 641, 506,
        779, 494, 633, 590],
       [557, 570, 786, 807, 690, 469, 804, 828, 704, 573, 702, 675, 612,
        620, 585, 751, 625, 749, 649, 752, 563, 675, 712, 758, 793, 672,
        754, 550, 756, 638],
       [605, 507, 664, 701, 660, 496, 698, 806, 651, 575, 604, 576, 453,
        663, 563, 674, 586, 634, 735, 613, 582, 685, 668, 586, 629, 534,
        678, 484, 591, 626],
       [599, 681, 753, 873, 721, 563, 754, 770, 620, 654, 692, 563, 546,
        685, 562, 760, 548, 627, 729, 715, 633, 747, 661, 677, 726, 649,
        716, 610, 735, 706],
       [422, 354, 602, 627, 613, 396, 617, 627, 489, 423, 559, 408, 396,
        575, 514, 558, 406, 469, 451, 444, 456, 572, 559, 537, 499, 384,
        589, 436, 574, 507],
       [359, 446, 599, 599, 481, 357, 577, 572, 451, 464, 495, 531, 441,
        498, 412, 574, 422, 482, 503, 600, 449, 550, 495, 532, 633, 554,
        663, 476, 565, 602],
       [531, 520, 698, 590, 607, 537, 665, 696, 571, 472, 538, 574, 463,
        633, 529, 635, 504, 532, 605, 690, 576, 588, 551, 665, 652, 527,
        742, 528, 650, 599],
       [449, 322, 547, 533, 593, 399, 584, 638, 587, 424, 519, 435, 336,
        495, 511, 523, 412, 476, 464, 427, 402, 596, 523, 523, 447, 362,
        561, 386, 529, 484],
       [373, 433, 525, 601, 522, 345, 551, 521, 434, 447, 507, 388, 387,
        522, 367, 524, 413, 419, 452, 523, 508, 498, 438, 478, 459, 418,
        488, 407, 503, 496],
       [500, 427, 574, 607, 667, 477, 652, 656, 615, 477, 615, 468, 450,
        616, 524, 706, 463, 530, 615, 574, 622, 702, 531, 610, 558, 532,
        598, 471, 582, 561],
       [664, 694, 772, 841, 779, 574, 730, 810, 711, 608, 712, 664, 496,
        794, 690, 756, 609, 633, 609, 698, 591, 760, 616, 638, 721, 676,
        846, 678, 754, 708],
       [545, 547, 687, 701, 721, 576, 689, 724, 710, 532, 691, 541, 532,
        699, 605, 797, 555, 623, 645, 583, 674, 684, 648, 694, 710, 564,
        757, 571, 671, 656],
       [574, 586, 723, 750, 691, 494, 696, 787, 667, 523, 648, 596, 466,
        664, 578, 625, 572, 667, 673, 720, 618, 681, 568, 682, 715, 644,
        756, 557, 690, 604],
       [502, 382, 645, 557, 570, 403, 538, 677, 500, 501, 489, 439, 402,
        620, 449, 497, 463, 476, 573, 552, 369, 650, 507, 576, 546, 531,
        554, 437, 616, 463],
       [510, 505, 736, 651, 649, 510, 719, 733, 694, 557, 623, 634, 457,
        611, 508, 695, 605, 630, 673, 685, 605, 717, 574, 642, 678, 576,
        755, 455, 598, 654],
       [567, 376, 614, 612, 643, 514, 598, 724, 547, 464, 569, 410, 410,
        635, 516, 546, 456, 503, 520, 560, 456, 639, 520, 560, 569, 442,
        596, 517, 659, 532],
       [626, 716, 828, 765, 740, 603, 809, 852, 692, 591, 646, 659, 545,
        738, 595, 813, 615, 637, 705, 774, 664, 716, 655, 721, 742, 612,
        819, 593, 744, 712],
       [600, 559, 667, 664, 641, 556, 624, 815, 638, 564, 719, 532, 533,
        680, 559, 717, 603, 588, 637, 646, 581, 701, 559, 677, 710, 554,
        748, 597, 614, 657],
       [445, 431, 661, 681, 641, 552, 690, 719, 602, 474, 638, 471, 486,
        507, 602, 614, 498, 587, 504, 483, 515, 637, 576, 620, 572, 512,
        599, 455, 622, 538],
       [523, 569, 784, 725, 713, 501, 740, 772, 638, 640, 641, 627, 549,
        706, 568, 804, 610, 607, 690, 692, 589, 775, 664, 686, 726, 672,
        747, 548, 723, 645],
       [487, 465, 553, 639, 517, 449, 592, 609, 454, 398, 513, 433, 421,
        522, 525, 549, 440, 480, 411, 441, 492, 567, 534, 404, 554, 417,
        561, 466, 498, 492],
       [479, 449, 574, 686, 583, 377, 566, 614, 563, 455, 529, 487, 334,
        607, 500, 669, 398, 541, 591, 493, 453, 539, 491, 501, 596, 520,
        722, 478, 565, 501],
       [483, 386, 476, 526, 550, 426, 492, 585, 536, 482, 523, 437, 383,
        506, 414, 578, 429, 431, 457, 448, 322, 541, 438, 456, 487, 408,
        502, 426, 474, 481],
       [523, 551, 658, 767, 537, 444, 663, 731, 576, 577, 564, 530, 512,
        555, 436, 665, 469, 598, 679, 692, 522, 590, 525, 664, 691, 548,
        635, 526, 641, 538],
       [652, 656, 738, 753, 853, 508, 752, 815, 669, 576, 678, 553, 428,
        805, 641, 754, 639, 604, 669, 739, 694, 833, 693, 606, 575, 616,
        704, 559, 728, 672],
       [578, 577, 744, 856, 699, 497, 779, 800, 733, 587, 731, 524, 560,
        734, 579, 763, 543, 676, 758, 685, 630, 754, 704, 834, 760, 680,
        765, 592, 731, 629],
       [554, 494, 665, 689, 630, 574, 695, 703, 636, 599, 617, 582, 532,
        644, 488, 701, 456, 498, 594, 632, 554, 685, 532, 658, 649, 554,
        693, 577, 634, 668],
       [498, 552, 659, 784, 552, 492, 690, 775, 544, 551, 573, 532, 505,
        616, 522, 709, 497, 621, 636, 634, 567, 636, 518, 599, 742, 521,
        733, 533, 605, 604],
       [513, 491, 563, 642, 477, 367, 589, 647, 516, 484, 369, 482, 361,
        640, 420, 536, 432, 521, 635, 584, 428, 574, 504, 548, 553, 483,
        540, 407, 547, 455]])

##### 查看运行时间

In [84]:
# 查看运行时间
%timeit np.dot(x,y)

49.5 µs ± 4.72 µs per loop (mean ± std. dev. of 7 runs, 10000 loops each)

**numpy vs pandas 执行速度对比**

一般来说, 
- numpy的计算速度更快.
- pandas更偏向数据处理.

##### pandas==>numpy转换

In [85]:
# pandas ==> np.array
x1 = np.array(x)

#### 广播运算

In [86]:
x = pd.DataFrame(np.random.randint(0, 10, size=(3, 3)), columns=["a", "b", "c"])
x

   a  b  c
0  9  2  4
1  0  3  5
2  2  6  2

In [87]:
# 第0行
x.iloc[0]

# 矩阵每行都➗第0行
x / x.iloc[0]

          a    b     c
0  1.000000  1.0  1.00
1  0.000000  1.5  1.25
2  0.222222  3.0  0.50

**按列进行广播**

In [88]:
x.div(x.a, axis=0)  # axis=0 , 沿着垂直的方向进行计算

# x.a :
# [
#     1,
#     1,
#     3
# ]

# 按列进行广播
# [
# 1,1,1
# 1,1,1
# 3,3,3
# ]

     a         b         c
0  1.0  0.222222  0.444444
1  NaN       inf       inf
2  1.0  3.000000  1.000000

In [89]:
# 等价于
x2 = pd.DataFrame([[1, 1, 1], [1, 1, 1], [3, 3, 3]], columns=["a", "b", "c"])
x.div(x2)

          a    b         c
0  9.000000  2.0  4.000000
1  0.000000  3.0  5.000000
2  0.666667  2.0  0.666667

**按行进行广播**

In [90]:
x.div(x.iloc[0], axis=1)

# x.iloc[0]
# [1, 4, 6]

# 广播后
# [
#     1,4,6
#     1,4,6
#     1,4,6
# ]

          a    b     c
0  1.000000  1.0  1.00
1  0.000000  1.5  1.25
2  0.222222  3.0  0.50

### Pandas新的用法

#### 向量化运算--自动索引对齐

In [91]:
A = pd.DataFrame(np.random.randint(0, 20, size=(2, 2)), columns=list("AB"))
A

    A   B
0   8   0
1  13  18

In [92]:
B = pd.DataFrame(np.random.randint(0, 20, size=(3, 3)), columns=list("ABC"))
B

    A   B   C
0   6  11  19
1  12   4  13
2   8   3   5

**pandas会自动对齐两个对象的索引, 没有的值使用`np.nan`表示**

In [93]:
A + B

      A     B   C
0  14.0  11.0 NaN
1  25.0  22.0 NaN
2   NaN   NaN NaN

**也可以对缺失的值, 使用fill_value来填充**

In [94]:
# 这里A不存在的值, 都使用0表示
A.add(B, fill_value=0)

      A     B     C
0  14.0  11.0  19.0
1  25.0  22.0  13.0
2   8.0   3.0   5.0

#### 统计相关

##### 数据种类统计

In [95]:
y = np.random.randint(3, size=10)
y

y1 = pd.DataFrame(y, columns=["A"])
y1

   A
0  2
1  1
2  2
3  0
4  1
5  0
6  0
7  1
8  0
9  1

In [96]:
# 查看numpy y的取值构成
np.unique(y)
             # array([0, 1, 2])

# 查看pandas "A"列的取值构成
np.unique(y1["A"])
            # array([0, 1, 2])

# count number of distinct elements in the specific axis.
y1.nunique(axis=0, dropna=True) # 统计各列的不同元素个数
            # A    3
            # dtype: int64

A    3
dtype: int64

In [97]:
# 查看numpy y的各取值统计信息
from collections import Counter

Counter(y)
    
# 调用pandas自己的方法 
# Return a Series containing counts of unique values.
y1.value_counts() # 显示各元素个数
y1.value_counts(normalize=True) # 显示各元素比例

A
0    0.4
1    0.4
2    0.2
dtype: float64

##### 产生新的结果, 并按照某列数据进行排序

In [98]:
population_dict = {"beijing": 1234, "shanghai": 5678}
gdp_dict = {"beijing": 10000, "shanghai": 20000}

population = pd.Series(population_dict)
gdp = pd.Series(gdp_dict)

# "pupulatin"/"gdp"为column名字
city_info = pd.DataFrame({"population": population, "gdp": gdp})
city_info

          population    gdp
beijing         1234  10000
shanghai        5678  20000

In [99]:
# 添加人均GDP
city_info["per_gdp"] = city_info["gdp"] / city_info["population"]
city_info

          population    gdp   per_gdp
beijing         1234  10000  8.103728
shanghai        5678  20000  3.522367

In [100]:
# 按照某列数据: 递增排序
city_info.sort_values(by="per_gdp")

          population    gdp   per_gdp
shanghai        5678  20000  3.522367
beijing         1234  10000  8.103728

In [101]:
# 按照某列数据: 递减排序
city_info.sort_values(by="per_gdp", ascending=False)

          population    gdp   per_gdp
beijing         1234  10000  8.103728
shanghai        5678  20000  3.522367

##### 按照axis进行排序

In [102]:
data = pd.DataFrame(np.random.randint(0, 10, size=(3, 2)), index=[i for i in range(3)])
data

   0  1
0  4  6
1  1  6
2  9  3

In [103]:
# 行排序(按照index的值进行排序)
data.sort_index(axis=0)

   0  1
0  4  6
1  1  6
2  9  3

In [104]:
# 列排序(按照columns的值进行排序)
data.sort_index(axis=1, ascending=False)

   1  0
0  6  4
1  6  1
2  3  9

##### 统计方法

In [105]:
data = pd.DataFrame(np.random.randint(2, 4, size=(6, 4)), columns=list("ABCD"))
data

   A  B  C  D
0  2  3  2  3
1  3  3  2  3
2  2  2  2  3
3  2  3  3  3
4  2  2  2  2
5  2  3  2  3

In [106]:
# 非空个数
data.count()

A    6
B    6
C    6
D    6
dtype: int64

In [107]:
# 求和
# 按行求和
data.sum(axis=1)

# 按列求和
data.sum(axis=0)  # 默认是按列

A    13
B    16
C    13
D    17
dtype: int64

In [108]:
# max / min
data.min(axis=1)  # 默认是按列

0    2
1    2
2    2
3    2
4    2
5    2
dtype: int64

In [109]:
# max / min 坐标
data.idxmax(axis=1)  # 默认是按列

0    B
1    A
2    D
3    B
4    A
5    B
dtype: object

In [110]:
# 均值
data.mean()

A    2.166667
B    2.666667
C    2.166667
D    2.833333
dtype: float64

In [111]:
# 方差
data.var()

# 标准差
data.std(axis=1)

0    0.57735
1    0.50000
2    0.50000
3    0.50000
4    0.00000
5    0.57735
dtype: float64

In [112]:
# 中位数
data.median()

A    2.0
B    3.0
C    2.0
D    3.0
dtype: float64

In [121]:
# 众数
data.mode()

array([3])

In [277]:
# 75%分位数
data.quantile(0.75)

A    2.0
B    3.0
C    2.0
D    3.0
Name: 0.75, dtype: float64

In [278]:
# 各种常用统计信息
data.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   2.166667  2.666667  2.166667  2.833333
std    0.408248  0.516398  0.408248  0.408248
min    2.000000  2.000000  2.000000  2.000000
25%    2.000000  2.250000  2.000000  3.000000
50%    2.000000  3.000000  2.000000  3.000000
75%    2.000000  3.000000  2.000000  3.000000
max    3.000000  3.000000  3.000000  3.000000

In [279]:
# 相关性系数
data.corr()

          A         B         C         D
A  1.000000  0.316228 -0.200000  0.200000
B  0.316228  1.000000  0.316228  0.632456
C -0.200000  0.316228  1.000000  0.200000
D  0.200000  0.632456  0.200000  1.000000

In [280]:
# 和某一列的相关性系数
data.corrwith(data["A"])

A    1.000000
B    0.316228
C   -0.200000
D    0.200000
dtype: float64

#### 自定义输出 apply

In [281]:
data = pd.DataFrame(np.random.randn(3, 2), columns=list("AB"))
data

          A         B
0  1.746435 -0.775070
1  0.141641 -2.516304
2 -0.595668 -0.309121

In [282]:
# 默认对每一列进行自定义操作
data.apply(np.cumsum)  # 累加操作

          A         B
0  1.746435 -0.775070
1  1.888076 -3.291374
2  1.292408 -3.600495

In [283]:
# 对每一行进行自定义操作
data.apply(np.cumsum, axis=1)

          A         B
0  1.746435  0.971365
1  0.141641 -2.374663
2 -0.595668 -0.904789

In [284]:
data.apply(lambda x: x.max() - x.min())  # 默认对列进行操作, 列的最大值 - 最小值

A    2.342103
B    2.207183
dtype: float64

In [285]:
# 这里传入的每一列
def customer_describe(x):
    return pd.Series(
        [x.mean(), x.count(), x.idxmax(), x.idxmin()],
        index=["Mean", "Cound", "idMax", "idMin"],
    )


data.apply(customer_describe)

              A         B
Mean   0.430803 -1.200165
Cound  3.000000  3.000000
idMax  0.000000  2.000000
idMin  2.000000  1.000000

# 缺失值处理

## 发现缺失值

In [286]:
# np.nan是一种特殊的float类型

data = pd.DataFrame([[1, 2, np.nan, 3], [4, 5, None, 6], [7, 6, 5, 4]])
data

   0  1    2  3
0  1  2  NaN  3
1  4  5  NaN  6
2  7  6  5.0  4

In [287]:
data.isnull()
data.isna()

       0      1      2      3
0  False  False   True  False
1  False  False   True  False
2  False  False  False  False

In [288]:
data.notnull()

      0     1      2     3
0  True  True  False  True
1  True  True  False  True
2  True  True   True  True

## 删除缺失值

- **删除有缺失值的整行数据**

In [289]:
data.dropna()  # 沿着垂直方向, 依次删除有np.nan的数据行

   0  1    2  3
2  7  6  5.0  4

- **删除有缺失值的整列数据, 沿水平方向, 依次删除有np.nan的列**

In [290]:
data.dropna(axis=1)  # data.dropna(axis="columns")

   0  1  3
0  1  2  3
1  4  5  6
2  7  6  4

- **指定删除策略**

In [291]:
data.dropna(axis=1, how="all")  # 沿着水平方向, 依次删除全部都是np.nan的列

   0  1    2  3
0  1  2  NaN  3
1  4  5  NaN  6
2  7  6  5.0  4

In [292]:
data.dropna(axis=1, how="any")  # 沿着水平方向, 依次删除含有np.nan的列

   0  1  3
0  1  2  3
1  4  5  6
2  7  6  4

## 填充缺失值

- **填充固定的值**

In [293]:
data.fillna(0, inplace=False)

   0  1    2  3
0  1  2  0.0  3
1  4  5  0.0  6
2  7  6  5.0  4

- **用均值进行填充**

In [294]:
# 求出各列的平均值
fill_with_mean = data.mean()  # 默认axis=0, 求各列的平均值
fill_with_mean

0    4.000000
1    4.333333
2    5.000000
3    4.333333
dtype: float64

In [295]:
# 用各列的平均值对各列的NaN进行填充
data.fillna(value=fill_with_mean)

   0  1    2  3
0  1  2  5.0  3
1  4  5  5.0  6
2  7  6  5.0  4

In [296]:
# 用全部数据的平均值, 对NaN进行填充
# stack() 摊平数据
fill_with_all_mean = data.stack().mean()
data.fillna(value=fill_with_all_mean)

   0  1    2  3
0  1  2  4.3  3
1  4  5  4.3  6
2  7  6  5.0  4

## 合并数据集

In [297]:
def generate_df(cols, idxs):
    dict = {}
    for col in cols:
        dict[col] = [str(col) + str(idx) for idx in idxs]

    return pd.DataFrame(data=dict, index=idxs)


generate_df(cols=list("ABC"), idxs=range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

- **垂直合并**

In [298]:
df1 = generate_df(cols=list("AB"), idxs=[1, 2])
df2 = generate_df(cols=list("AB"), idxs=[2, 3])
print(df1)
print(df2)

    A   B
1  A1  B1
2  A2  B2
    A   B
2  A2  B2
3  A3  B3

In [299]:
pd.concat([df1, df2])

    A   B
1  A1  B1
2  A2  B2
2  A2  B2
3  A3  B3

In [300]:
# 忽略行标签(防止歧义)
pd.concat([df1, df2], ignore_index=True)

    A   B
0  A1  B1
1  A2  B2
2  A2  B2
3  A3  B3

- **水平合并**

In [301]:
df1 = generate_df(cols=list("AB"), idxs=[1, 2])
df2 = generate_df(cols=list("BC"), idxs=[1, 2])
print(df1)
print(df2)

    A   B
1  A1  B1
2  A2  B2
    B   C
1  B1  C1
2  B2  C2

In [302]:
pd.concat([df1, df2], axis=1)

    A   B   B   C
1  A1  B1  B1  C1
2  A2  B2  B2  C2

- **merge 对齐, 根据相同的列进行合并**

In [303]:
# 只会保留共同的index(行)
pd.merge(df1, df2)

# 保留所有的index(行)
pd.merge(df1, df2, how="outer")

    A   B   C
0  A1  B1  C1
1  A2  B2  C2

In [304]:
# [例子]
population_dict = {
    "city": ["beijing", "shanghai", "shenzhen"],
    "pop": [1000, 2000, 3000],
}
population = pd.DataFrame(population_dict)
print(population)

gdp_dict = {"city": ["beijing", "shanghai"], "gdp": [10000, 20000]}
gdp = pd.DataFrame(gdp_dict)
print(gdp)

       city   pop
0   beijing  1000
1  shanghai  2000
2  shenzhen  3000
       city    gdp
0   beijing  10000
1  shanghai  20000

In [305]:
# 保留共同的行index
pd.merge(population, gdp)

       city   pop    gdp
0   beijing  1000  10000
1  shanghai  2000  20000

In [306]:
# 保留所有行index
pd.merge(population, gdp, how="outer")

       city   pop      gdp
0   beijing  1000  10000.0
1  shanghai  2000  20000.0
2  shenzhen  3000      NaN

# 分组和数据透视表

In [307]:
df = pd.DataFrame(
    {
        "key": ["A", "B", "C", "C", "B", "A"],
        "data1": range(6),
        "data2": np.random.randint(0, 10, size=6),
    }
)
df

  key  data1  data2
0   A      0      0
1   B      1      1
2   C      2      2
3   C      3      4
4   B      4      6
5   A      5      0

## 分组

In [308]:
# Group DataFrame using a mapper or by a Series of columns.
# 使用 mapper 或者 一系列的column 进行分组

### 按照某一列的值进行分组

**A label or list of labels may be passed to group by the columns in self.**

In [309]:
# 按照column key进行分组, column key有"A" "B" "C"三个值, 故分为三组:"A"一组, "B"一组, "C"一组
df.groupby("key")  # 延迟计算

In [310]:
df.groupby("key").sum() # 对这三个组分别求和

     data1  data2
key
A        5      0
B        5      7
C        5      6

In [311]:
df.groupby("key").mean()

     data1  data2
key
A      2.5    0.0
B      2.5    3.5
C      2.5    3.0

### 分组后, 取某一具体的列

In [312]:
df.groupby("key")["data1"].sum()

key
A    5
B    5
C    5
Name: data1, dtype: int64

### 按照组进行迭代

In [313]:
for group_name, group_info in df.groupby("key"):
    print(group_name)
    print(type(group_info))
    print("{0:5} shape={1}".format(group_name, group_info.shape))
    print("\n")

A
<class 'pandas.core.frame.DataFrame'>
A     shape=(2, 3)


B
<class 'pandas.core.frame.DataFrame'>
B     shape=(2, 3)


C
<class 'pandas.core.frame.DataFrame'>
C     shape=(2, 3)

### 分组后,调用方法

In [314]:
df.groupby("key")["data1"].describe()

     count  mean       std  min   25%  50%   75%  max
key
A      2.0   2.5  3.535534  0.0  1.25  2.5  3.75  5.0
B      2.0   2.5  2.121320  1.0  1.75  2.5  3.25  4.0
C      2.0   2.5  0.707107  2.0  2.25  2.5  2.75  3.0

### 更多的分组统计操作

In [315]:
# 针对各个分组, 求出所有cols的相应信息
df.groupby("key").aggregate(["min", "max"])

    data1     data2
      min max   min max
key
A       0   5     0   0
B       1   4     1   6
C       2   3     2   4

### 分组后, 过滤操作

In [316]:
df.groupby("key").std()

        data1     data2
key
A    3.535534  0.000000
B    2.121320  3.535534
C    0.707107  1.414214

In [317]:
# 将"data1" column的分组中, 标准差<1的组都过滤掉
def filter_std(x):
    return x["data1"].std() > 1


df.groupby("key").filter(filter_std)

  key  data1  data2
0   A      0      0
1   B      1      1
4   B      4      6
5   A      5      0

### 将自定义函数, 应用到每个分组上

In [318]:
# 将每个分组的数据, 减去它的均值
df.groupby("key").transform(lambda x: x - x.mean())  # transform只作用于除了"key"之外的columns

   data1  data2
0   -2.5    0.0
1   -1.5   -2.5
2   -0.5   -1.0
3    0.5    1.0
4    1.5    2.5
5    2.5    0.0

In [319]:
# arg: x, 为一个分组数据
def norm_data1(x):
    # 归一化"data1"这一列
    x["data1"] /= x["data1"].sum()
    return x


df.groupby("key").apply(norm_data1)  # apply会作用于所有的columns

  key  data1  data2
0   A    0.0      0
1   B    0.2      1
2   C    0.4      2
3   C    0.6      4
4   B    0.8      6
5   A    1.0      0

### 自定义分组的label

In [320]:
new_key = [1, 2, 0, 0, 2, 1]
df

  key  data1  data2
0   A      0      0
1   B      1      1
2   C      2      2
3   C      3      4
4   B      4      6
5   A      5      0

In [321]:
df.groupby(new_key).sum()

# 使用新的groupby key后, index发生了变化
# 1	A	0	2
# 2	B	1	7
# 0	C	2	8
# 0	C	3	3
# 2	B	4	4
# 1	A	5	0
# 此时按照新的index进行分组

   data1  data2
0      5      6
1      5      0
2      5      7

### 将某一列设置为DataFrame的标签(index)

In [322]:
# 将"key"这列的数据, 作为新的index(label)
df2 = df.set_index("key")
df2

     data1  data2
key
A        0      0
B        1      1
C        2      2
C        3      4
B        4      6
A        5      0

### 用字典映射的方式, 设置分组的key(接上一步结果)

In [323]:
group_key_mapping = {"A": "first", "B": "other", "C": "other"}
# 这里将 "B"和"C" 合并为了一个组 "other"
df2.groupby(group_key_mapping).sum()

       data1  data2
key
first      5      0
other     10     13

In [324]:
#### 使用任意的python函数作为分组的key
df2.groupby(str.lower).mean()

     data1  data2
key
a      2.5    0.0
b      2.5    3.5
c      2.5    3.0

### 使用多个分组key进行分组(接上一步结果)

In [325]:
# 针对原始key, 只有自定义的两个key都相同, 才会分成一组
df2.groupby([str.lower, group_key_mapping]).sum()

           data1  data2
key key
a   first      5      0
b   other      5      7
c   other      5      6

- **举例: 星星观测数据处理**

In [326]:
import seaborn as sns

planets = sns.load_dataset("planets")

URLError: <urlopen error [Errno 61] Connection refused>

In [ ]:
planets.shape

In [ ]:
planets.head()

In [ ]:
planets.describe()

In [ ]:
# 构建我们自己需要的一个新列(新的特征)
decade = 10 * (planets["year"] // 10)
decade = decade.astype(str) + "s"  # 转化为str类型
decade.name = "decade"  # 修改column的名字

In [ ]:
# 求出 不同方式 不同年份 发现的行星数量 ==> groupby
planets.groupby(
    ["method", decade]
).sum()  # decade虽然不在原始数据中, 但是pandas自己把这一列添加到了原始数据中, 作为一个新的column "decade"

In [ ]:
# unstack() 将数据的主副标签展开
planets.groupby(["method", decade])[["number"]].sum().unstack().fillna(0)

## 数据透视表

- **举例:泰坦尼克号[不用数据透视表]**

In [ ]:
import seaborn as sns

titanic = sns.load_dataset("titanic")

titanic.head()

In [ ]:
titanic.describe()

In [ ]:
# 看一下不同性别的存活率

titanic.groupby(by="sex")["survived"].mean()  # 一个中括号[], 取出来的是Series的数据

titanic.groupby(by="sex")[["survived"]].mean()  # 两个中括号[[]], 取出来的是DataFrame的数据

In [ ]:
# 看下不同性别, 不同船舱的乘客的存活率和存活人数
titanic.groupby(["sex", "class"])[["survived"]].aggregate(["mean", "sum"]).unstack()

- **使用数据透视表**

In [ ]:
# 查看不同sex, 不同船舱的存活率
# 要观察哪列数据, 横轴是什么, 纵轴是什么, 要对数据进行什么处理
titanic.pivot_table("survived", index="sex", columns="class", aggfunc="mean")

In [ ]:
# 查看下各个维度的汇总数据
titanic.pivot_table(
    "survived", index="sex", columns="class", aggfunc="mean", margins=True
)

In [ ]:
# 查看sex, class维度下的, 存活率平均值 和 票价平均值 (对不同的维度, 使用不同的统计方法)
titanic.pivot_table(
    index="sex", columns="class", aggfunc={"survived": "mean", "fare": "mean"}
)

# 其他

## 向量化字符串操作

## 处理时间序列

## 多级索引: 用于多维数据

In [ ]:
data = np.random.randint(10, 100, size=(6, 2))
data = pd.DataFrame(
    data,
    index=[["bj", "bj", "sh", "sh", "nj", "nj"], ["2008", "2018"] * 3],
    columns=["population", "gdp"],
)
data

In [ ]:
# 给label设置名称
data.index.names = ["city", "year"]
data

In [ ]:
# 取列数据
data["gdp"]

In [ ]:
# 取行数据
data.loc["bj", "2008"]

## 高性能计算

### eval()

In [ ]:
df1, df2, df3, df4 = (
    pd.DataFrame(np.random.randint(0, 100, size=(1000000, 100))) for i in range(4)
)
df4.shape

In [ ]:
%timeit (df1 + df2) / (df3 + df4)

In [ ]:
%timeit pd.eval("(df1 + df2) / (df3 + df4)")

In [ ]:
# 检查两个数据是否一致
np.allclose((df1 + df2) / (df3 + df4), pd.eval("(df1 + df2) / (df3 + df4)"))

### query()

In [ ]:
df = pd.DataFrame(np.random.random(size=(5, 4)), columns=["A", "B", "C", "D"])
df

In [ ]:
%timeit df[(df.A < 0.5) & (df.D > 0.5)]

In [ ]:
%timeit df.query("(A < 0.5) & (D > 0.5)")

### 使用时机

超大数据量时, 才使用.
小数据量, 使用普通的计算方法